# Clock constraints
create_clock -name i_clk -period 10 -waveform {0 5} [get_ports "i_clk"]
set_clock_transition -rise 0.1 [get_clocks "i_clk"]
set_clock_transition -fall 0.1 [get_clocks "i_clk"]
set_clock_uncertainty 0.01 [get_clocks "i_clk"]
set_input_delay -max 1.0 [get_ports "rst"] -clock [get_clocks "i_clk"]
set_input_delay -max 1.0 [get_ports "i_mode"] -clock [get_clocks "i_clk"]
set_input_delay -max 1.0 [get_ports "i_clk"] -clock [get_clocks "i_clk"]
set_input_delay -max 1.0 [get_ports "i_clr"] -clock [get_clocks "i_clk"]
set_input_delay -max 1.0 [get_ports "i_en"] -clock [get_clocks "i_clk"]
set_input_delay -max 1.0 [get_ports "[63:0] i_A"] -clock [get_clocks "i_clk"]
set_input_delay -max 1.0 [get_ports "i_B"] -clock [get_clocks "i_clk"]
set_output_delay -max 1.0 [get_ports "[63:0] o_res"] -clock [get_clocks "i_clk"]
