# Clock constraints
create_clock -name clk -period 10 -waveform {0 5} [get_ports "clk"]
set_clock_transition -rise 0.1 [get_clocks "clk"]
set_clock_transition -fall 0.1 [get_clocks "clk"]
set_clock_uncertainty 0.01 [get_clocks "clk"]
create_clock -name clk -period 10 -waveform {0 5} [get_ports "clk"]
set_clock_transition -rise 0.1 [get_clocks "clk"]
set_clock_transition -fall 0.1 [get_clocks "clk"]
set_clock_uncertainty 0.01 [get_clocks "clk"]
create_clock -name clk -period 10 -waveform {0 5} [get_ports "clk"]
set_clock_transition -rise 0.1 [get_clocks "clk"]
set_clock_transition -fall 0.1 [get_clocks "clk"]
set_clock_uncertainty 0.01 [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "reset"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "reset"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "reset"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "signed   [31:0] X"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "[31:0] X"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "clk"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "reset"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "signed   [31:0] X"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "[31:0] X"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "clk"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "reset"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "[31:0] inData"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "clk"] -clock [get_clocks "clk"]
set_input_delay -max 1.0 [get_ports "reset"] -clock [get_clocks "clk"]
set_output_delay -max 1.0 [get_ports "[31:0] Y"] -clock [get_clocks "clk"]
set_output_delay -max 1.0 [get_ports "[31:0] Y"] -clock [get_clocks "clk"]
set_output_delay -max 1.0 [get_ports "[31:0] outData"] -clock [get_clocks "clk"]
